Updated tests and OSS information.
